reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
// ===========================================================================
//  [4] COLAS
// ===========================================================================
//
//   RPi --USB--> SerialTask --> motorCmdQueue      (len 1, overwrite) --> MotorTask
//                           --> gripperCmdQueue    (len 4, FIFO)      --> GripperTask
//                           --> ledCmdQueue        (len 1, overwrite) --> LedTask
//                           --> flagSignalCmdQueue (len 1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (len 4, FIFO)      --> SerialTask --USB--> RPi
//   ReflectanceTask --> reflectQueue (len 4, FIFO)      --> SerialTask --USB--> RPi
//   TofSensorTask   --> tofQueue     (len 4, FIFO)      --> SerialTask --USB--> RPi
//   SupervisorTask  --> healthQueue  (len 1, overwrite) --> SerialTask --USB--> RPi
//   LedTask         --> teamSwitchQueue (len 1, overwrite) --> SerialTask --USB--> RPi
//
//  Las colas "overwrite" (largo 1) son para datos donde solo importa el valor
//  más reciente: un comando de motores viejo no debe ejecutarse nunca. Las
//  FIFO son para eventos que deben procesarse todos y en orden (el gripper
//  tiene que abrir ANTES de bajar, no al revés).
//
//  Regla que se respeta en todo el archivo: ninguna tarea usa portMAX_DELAY
//  dentro de su bucle principal. Todas las operaciones de cola llevan timeout
//  0, de forma que un productor lento jamás cuelgue al consumidor.

static QueueHandle_t g_motorCmdQueue      = nullptr;
static QueueHandle_t g_gripperCmdQueue    = nullptr;
static QueueHandle_t g_ledCmdQueue        = nullptr;
static QueueHandle_t g_flagSignalCmdQueue = nullptr;
static QueueHandle_t g_colorQueue         = nullptr;
static QueueHandle_t g_reflectQueue       = nullptr;
static QueueHandle_t g_tofQueue           = nullptr;
static QueueHandle_t g_healthQueue        = nullptr;
static QueueHandle_t g_teamSwitchQueue    = nullptr;

// Última lectura del switch físico de equipo, publicada por LedTask en cada
// vuelta. MotorTask la lee para negarse a mover el robot mientras nadie haya
// elegido equipo (posición 0/central) — igual que ya se niega a moverse si
// el enlace con la Raspberry Pi se cae (COMMS_FAILSAFE_TIMEOUT_MS): es un
// segundo freno de seguridad, independiente del primero, y no depende de que
// el software de la Raspberry Pi haga lo correcto. Un uint8_t/enum de un
// byte se lee y escribe atómicamente en el ESP32-S3, así que no hace falta
// mutex para esto (no es el "estado global" que evita el resto del diseño:
// es una sola bandera de solo lectura para todos menos LedTask).
static volatile TeamColor g_switchTeam = TeamColor::NONE;

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº0 (Wire) — TCS34725 delantero + VL53L1X.
// ---------------------------------------------------------------------------
//  LAS DOS TAREAS QUE TOCAN ESTE BUS CORREN EN EL MISMO NÚCLEO (0: sensores),
//  pero eso NO alcanza para que `Wire`/`TwoWire` sea segura entre ellas:
//  ninguna de las dos deshabilita el planificador durante una transacción
//  I2C, así que un cambio de contexto a mitad de un beginTransmission()/
//  endTransmission() puede intercalar los bytes de ColorSensorTask con los
//  de TofSensorTask sobre el mismo objeto `Wire`. Corrompe el bus de forma
//  intermitente — exactamente los "problemas de I2C" que se vieron en banco
//  entre el ToF y el sensor de color — sin que ninguno de los dos esté roto
//  por separado.
//
//  Este mutex serializa toda transacción sobre el bus 0: cada tarea lo toma
//  antes de tocar `Wire` y lo suelta apenas termina.
//
//  Con timeout corto (no portMAX_DELAY, por la misma regla que las colas): si
//  no se consigue el bus en I2C0_LOCK_TIMEOUT_MS, la operación se da por
//  fallida esta vuelta y se reintenta en la siguiente — mismo espíritu que ya
//  tienen los drivers de este archivo (nunca bloquear indefinidamente a
//  cambio de un periférico que tarda).
//
//  Se diagnosticó y se arregló primero en firmware-esp32-standalone/ (commit
//  75ad526). Este firmware tenía EXACTAMENTE el mismo bus compartido, aunque
//  ahora entre dos tareas y no tres: el PCA9685, que también vivía acá, se
//  movió al bus 1 (ver g_i2c1Mutex, justo abajo) por decisión del equipo.
static SemaphoreHandle_t g_i2c0Mutex = nullptr;
constexpr uint32_t I2C0_LOCK_TIMEOUT_MS = 50;

static inline bool I2c0Lock() {
    return xSemaphoreTake(g_i2c0Mutex, pdMS_TO_TICKS(I2C0_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c0Unlock() {
    xSemaphoreGive(g_i2c0Mutex);
}

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº1 (Wire1) — TCS34725 trasero + PCA9685 (servos).
// ---------------------------------------------------------------------------
//  Mismo problema que el bus 0, con el mismo mecanismo: GripperTask (el
//  PCA9685) corre en el núcleo 1, ColorSensorTask (el TCS34725 trasero) en
//  el núcleo 0 — con dos núcleos de por medio, ni siquiera hace falta que el
//  planificador las intercale mal: pueden estar ejecutando una transacción
//  I2C cada una AL MISMO TIEMPO. El bus 1 era seguro sin mutex mientras solo
//  tuviera un dispositivo (el TCS34725 trasero, sin nadie más con quien
//  competir); deja de serlo en cuanto el PCA9685 se muda acá.
static SemaphoreHandle_t g_i2c1Mutex = nullptr;
constexpr uint32_t I2C1_LOCK_TIMEOUT_MS = 50;

static inline bool I2c1Lock() {
    return xSemaphoreTake(g_i2c1Mutex, pdMS_TO_TICKS(I2C1_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c1Unlock() {
    xSemaphoreGive(g_i2c1Mutex);
}

// ===========================================================================
//  [5] WATCHDOG COOPERATIVO
// ===========================================================================
//
//  Cada tarea marca su heartbeat en cada vuelta de su bucle. El supervisor
//  revisa quién dejó de marcar.
//
//  Cada tarea escribe SOLO su propia celda del arreglo y el supervisor solo
//  lee, así que no hace falta mutex: no hay dos escritores para la misma
//  celda, y un uint32_t se escribe de forma atómica en esta arquitectura, de
//  modo que el supervisor nunca puede leer un valor a medias.

static volatile uint32_t g_lastHeartbeatMs[(size_t)TaskId::COUNT];

static void WatchdogInit() {
    const uint32_t now = millis();
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) g_lastHeartbeatMs[i] = now;
}

