reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    bool Init(TwoWire &bus) {
        uint8_t id = 0;
        if (!ReadReg(bus, REG_ID, id)) return false;
        // 0x44 = TCS34725, 0x4D = TCS34727. Cualquier otra cosa no es el sensor.
        if (id != 0x44 && id != 0x4D) return false;

        if (!WriteReg(bus, REG_ATIME, ATIME_24MS)) return false;
        if (!WriteReg(bus, REG_CONTROL, GAIN_4X)) return false;
        if (!WriteReg(bus, REG_ENABLE, ENABLE_PON)) return false;
        delay(3);                                   // arranque del oscilador
        return WriteReg(bus, REG_ENABLE, ENABLE_PON | ENABLE_AEN);
    }

    bool Read(TwoWire &bus, Rgbc &out) {
        bus.beginTransmission(I2CAddr::TCS34725);
        bus.write(CMD_BIT | CMD_AUTO_INC | REG_CDATAL);
        if (bus.endTransmission() != 0) return false;
        if (bus.requestFrom((int)I2CAddr::TCS34725, 8) != 8) return false;

        // Los cuatro canales llegan como uint16 little-endian, en orden C R G B.
        out.c = (uint16_t)(bus.read() | (bus.read() << 8));
        out.r = (uint16_t)(bus.read() | (bus.read() << 8));
        out.g = (uint16_t)(bus.read() | (bus.read() << 8));
        out.b = (uint16_t)(bus.read() | (bus.read() << 8));
        return true;
    }
}

// ---------------------------------------------------------------------------
//  Clasificación de color -> etiqueta de la pista.
//
//  Se normaliza cada canal contra el canal "clear" (luz total). Así la
//  decisión deja de depender del brillo absoluto, que cambia muchísimo con la
//  luz del salón, y pasa a depender solo del tono.
//
//  RECALIBRADO 2026-08-28 contra 970 muestras reales del TCS34725
//  DELANTERO (calibracion/color/data_logs/, generadas con
//  calibracion/color/calibrar_color.py) usando
//  calibracion/color/analizar_umbrales_tcs.py — descenso de coordenadas
//  sobre esta MISMA estructura de reglas. Error total 14.3% sobre esas 970
//  muestras (era 58.1% con los umbrales anteriores, sin calibrar). El
//  detalle completo —incluida la matriz de confusión por color— vive en
//  calibracion/color/detector-tcs/src/main.cpp, que usa exactamente estos
//  mismos números: si se recalibra, actualizar LOS DOS archivos o quedan
//  desincronizados (pasó antes con el umbral IR, commit c4f9b47).
//
//  ⚠️ NEGRO es la clase que peor acierta (58.5%, confundido sobre todo con
//  AZUL y GRIS): el rango de `clear` de NEGRO se solapa fuerte con el de
//  AZUL y GRIS, y esta clasificación secuencial por umbrales no separa bien
//  "oscuro" de "oscuro y además azul/gris". Es un límite estructural, no
//  algo que otra vuelta de ajuste vaya a arreglar — el clasificador K-NN de
//  pruebas-platformio/05-evitador-linea/ (mismo dataset, 4 dimensiones
//  juntas con distancia real en vez de reglas con AND encadenados) le
//  acierta bastante mejor a NEGRO. Si NEGRO/BLACK necesita ser confiable
//  para la lógica de vuelo, vale la pena portar ese enfoque acá en vez de
//  seguir afinando estos 9 umbrales.
//
//  ⚠️ TODAVÍA sin calibrar el sensor TRASERO: estos umbrales solo se
//  probaron contra datos del DELANTERO — comparten el mismo juego de
//  umbrales con el trasero por ahora, un supuesto sin verificar (ver
//  calibracion/color/README.md). Cuando existan capturas del trasero,
//  recalibrar y comparar antes de confiar en que un solo juego alcanza
//  para los dos.
// ---------------------------------------------------------------------------
static ColorLabel ClassifyColor(const Tcs34725::Rgbc &s) {
    // Muy poca luz reflejada = cinta negra (o el sensor mirando al vacío).
    if (s.c < 392) return ColorLabel::BLACK;

    const float total = (float)s.c;
    const float r = (float)s.r / total;
    const float g = (float)s.g / total;
    const float b = (float)s.b / total;

    if (r > 0.450f && g < 0.312f && b < 0.300f) return ColorLabel::RED;
    if (b > 0.216f && r < 0.390f)               return ColorLabel::BLUE;
    if (r > 0.416f && g > 0.350f && b < 0.250f) return ColorLabel::YELLOW;

    // Canales parejos = superficie gris: el tapete de la pista.
    return ColorLabel::FLOOR;
}

// ===========================================================================
//  [8] TAREAS
// ===========================================================================

namespace {

// ---------------------------------------------------------------------------
//  8.1  MotorTask — 4 motores a través de 2 drivers L298N
// ---------------------------------------------------------------------------
//  Es la tarea más crítica para la seguridad: si el enlace con la Raspberry Pi
//  se cae, ésta frena por su cuenta sin esperar a que nadie se lo ordene.
//
//  RECORDATORIO DE MONTAJE: hay que QUITAR los jumpers de ENA y ENB en ambos
//  L298N. Si se dejan puestos, el enable queda fijo a 5 V y el PWM no hace
//  absolutamente nada: los motores girarán siempre a full o nada.

struct Motor {
    uint8_t in1, in2, en, ledc_channel;
};

// kMotorFL: con el cableado físico actual, la rueda conectada a OUT1/OUT2
// del L298N izquierdo (la trasera izquierda del chasis) gira al revés
// respecto a las otras tres. En vez de ramificar MotorApply() con un flag de
// inversión, se intercambia el ORDEN de los dos GPIO aquí mismo: Pins::
// L298N_L_IN1 y L298N_L_IN2 siguen siendo, físicamente, los pines soldados a
// los terminales IN1 e IN2 del L298N (ver hardware/conexiones-esp32-s3.md) —
// lo único que cambia es cuál de los dos hace de "in1" y cuál de "in2" para
// ESTE motor, así que MotorApply() queda idéntica para los 4 motores. Si se
// recablea este motor para que coincida con los otros tres, basta con
// volver a poner IN1, IN2 en orden aquí.
constexpr Motor kMotorFL = {Pins::L298N_L_IN2, Pins::L298N_L_IN1, Pins::L298N_L_ENA, 0};
constexpr Motor kMotorRL = {Pins::L298N_L_IN3, Pins::L298N_L_IN4, Pins::L298N_L_ENB, 1};
constexpr Motor kMotorFR = {Pins::L298N_R_IN1, Pins::L298N_R_IN2, Pins::L298N_R_ENA, 2};
constexpr Motor kMotorRR = {Pins::L298N_R_IN3, Pins::L298N_R_IN4, Pins::L298N_R_ENB, 3};

// La API de LEDC cambió entre el core 2.x y el 3.x de Arduino-ESP32. Estas
// dos funciones absorben la diferencia para que el firmware compile en ambos.
// Reciben freq/resolución como parámetro porque no todos los canales PWM del
// robot usan los mismos: los motores van a 1 kHz/8 bits, el LED RGB a 5 kHz.
void PwmAttach(uint8_t pin, uint8_t channel, uint32_t freqHz, uint8_t resolution) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;                       // en 3.x el canal se asigna solo
    ledcAttach(pin, freqHz, resolution);
#else
    ledcSetup(channel, freqHz, resolution);
    ledcAttachPin(pin, channel);
#endif
}

void PwmWrite(uint8_t pin, uint8_t channel, uint32_t duty) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    (void)channel;
    ledcWrite(pin, duty);
#else
    (void)pin;
    ledcWrite(channel, duty);
#endif
}

void MotorSetup(const Motor &m) {
    pinMode(m.in1, OUTPUT);
    pinMode(m.in2, OUTPUT);
    PwmAttach(m.en, m.ledc_channel, Pwm::MOTOR_FREQ_HZ, Pwm::MOTOR_RESOLUTION);
    PwmWrite(m.en, m.ledc_channel, 0);
}

// speed: -100..100. El signo define el sentido, la magnitud el duty.
void MotorApply(const Motor &m, int speed) {
    speed = constrain(speed, -100, 100);
    const bool forward = (speed >= 0);
    digitalWrite(m.in1, forward ? HIGH : LOW);
    digitalWrite(m.in2, forward ? LOW  : HIGH);
    PwmWrite(m.en, m.ledc_channel, (uint32_t)abs(speed) * 255u / 100u);
}

void MotorsStop() {
    MotorApply(kMotorFL, 0);
    MotorApply(kMotorRL, 0);
    MotorApply(kMotorFR, 0);
    MotorApply(kMotorRR, 0);
}

