reymenez323/Athena-Rover-2026/firmware-esp32/src/main.cpp
    // VL53L1X en reset DESDE YA, antes de crear ninguna tarea. Ver la nota
    // larga en TofSensorTask: si se dejara este pin sin tocar hasta que esa
    // tarea arranque, ColorSensorTask (que corre en paralelo, en el mismo
    // bus I2C0) podría alcanzar a inicializar el TCS34725 delantero mientras
    // el VL53L1X sigue respondiendo en 0x29 por su cuenta (algunas placas
    // traen un pull-up en XSHUT que lo deja activo apenas se energiza).
    // Haciéndolo aquí, en setup(), antes de xTaskCreatePinnedToCore, queda
    // garantizado que pasa antes que cualquier tarea toque el bus.
    pinMode(Pins::TOF_XSHUT, OUTPUT);
    digitalWrite(Pins::TOF_XSHUT, LOW);

    // Los mutex de los dos buses I2C se crean ANTES que ninguna tarea: las
    // que los comparten los toman en su primera vuelta (ver g_i2c0Mutex y
    // g_i2c1Mutex).
    g_i2c0Mutex = xSemaphoreCreateMutex();
    g_i2c1Mutex = xSemaphoreCreateMutex();
    if (g_i2c0Mutex == nullptr || g_i2c1Mutex == nullptr) {
        DEBUG_LINK.println("[FATAL] no se pudo crear un mutex de bus I2C. Arranque detenido.");
        for (;;) delay(1000);
    }

    if (!CreateQueues()) {
        // Sin colas no hay comunicación entre tareas: arrancar a medias sería
        // peor que no arrancar, porque el robot se movería sin poder frenar.
        DEBUG_LINK.println("[FATAL] no se pudieron crear las colas. Arranque detenido.");
        for (;;) delay(1000);
    }

    // Los heartbeats se inicializan ANTES de crear ninguna tarea. Si se
    // hiciera después, se borrarían las marcas de las tareas que ya arrancaron
    // y el supervisor las vería como recién nacidas.
    WatchdogInit();

    xTaskCreatePinnedToCore(SupervisorTask, "Supervisor", TaskStack::SUPERVISOR,
                            nullptr, TaskPriority::SUPERVISOR, nullptr, 0);
    xTaskCreatePinnedToCore(SerialTask, "SerialComm", TaskStack::SERIAL_COMM,
                            nullptr, TaskPriority::SERIAL_COMM, nullptr, 1);
    xTaskCreatePinnedToCore(MotorTask, "Motors", TaskStack::MOTOR_CONTROL,
                            nullptr, TaskPriority::MOTOR_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(GripperTask, "Gripper", TaskStack::GRIPPER_CONTROL,
                            nullptr, TaskPriority::GRIPPER_CONTROL, nullptr, 1);
    xTaskCreatePinnedToCore(ColorSensorTask, "ColorSensors", TaskStack::COLOR_SENSOR,
                            nullptr, TaskPriority::COLOR_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(TofSensorTask, "TofSensor", TaskStack::TOF_SENSOR,
                            nullptr, TaskPriority::TOF_SENSOR, nullptr, 0);
    xTaskCreatePinnedToCore(ReflectanceTask, "Reflectance", TaskStack::REFLECTANCE,
                            nullptr, TaskPriority::REFLECTANCE, nullptr, 0);
    xTaskCreatePinnedToCore(LedTask, "TeamLed", TaskStack::LED_STATUS,
                            nullptr, TaskPriority::LED_STATUS, nullptr, 0);

    DEBUG_LINK.println("Todas las tareas lanzadas.");
}

void loop() {
    // Todo el trabajo ocurre en las tareas. loop() se queda vacío a propósito.
    vTaskDelay(pdMS_TO_TICKS(1000));
}
